
****** DONE Study RL [4/4] [100%]
        CLOSED: [2020-08-03 Mon 00:34] DEADLINE: <2020-08-02 Sun 23:59> SCHEDULED: <2020-07-30 Thu>
        :LOGBOOK:
        CLOCK: [2020-08-02 Sun 20:37]--[2020-08-03 Mon 00:34] =>  3:57
        CLOCK: [2020-08-02 Sun 18:31]--[2020-08-02 Sun 18:42] =>  0:11
        CLOCK: [2020-08-02 Sun 13:59]--[2020-08-02 Sun 17:25] =>  3:26
        CLOCK: [2020-08-02 Sun 11:52]--[2020-08-02 Sun 12:57] =>  1:05
        CLOCK: [2020-08-01 Sat 16:41]--[2020-08-01 Sat 18:45] =>  2:04
        CLOCK: [2020-08-01 Sat 13:35]--[2020-08-01 Sat 14:53] =>  1:18
        CLOCK: [2020-08-01 Sat 11:59]--[2020-08-01 Sat 13:13] =>  1:14
        CLOCK: [2020-07-31 Fri 22:29]--[2020-08-01 Sat 01:05] =>  2:36
        CLOCK: [2020-07-31 Fri 14:50]--[2020-07-31 Fri 20:39] =>  5:49
        CLOCK: [2020-07-31 Fri 12:13]--[2020-07-31 Fri 12:50] =>  0:37
        CLOCK: [2020-07-30 Thu 20:47]--[2020-07-31 Fri 00:35] =>  3:48
        CLOCK: [2020-07-30 Thu 18:58]--[2020-07-30 Thu 19:29] =>  0:31
        CLOCK: [2020-07-30 Thu 15:04]--[2020-07-30 Thu 18:15] =>  3:31
        :END:
        - [X] Complete Sutton and Barto Textbook [9/9] [100%]
          - [X] Chapter 9
          - [X] Chapter 10 
          - [X] Chapter 11 
          - [X] Chapter 12 
          - [X] Chapter 13 
          - [X] Chapter 14
          - [X] Chapter 15 
          - [X] Chapter 16 
          - [X] Chapter 17 
        - [X] Complete David Silver Lectures [4/4] [100%]
          - [X] Lecture 7
          - [X] Lecture 8
          - [X] Lecture 9
          - [X] Lecture 10
        - [X] Complete Deep RL Berkely Lectures [4/4] [100%]
          - [X] Lecture 4A
          - [X] Lecture 4B
          - [X] Lecture 5
          - [X] Lecture 6
        - [X] Skim updated DeepMind course
****** DONE Practice RL 
       CLOSED: [2020-08-19 Wed 10:52] DEADLINE: <2020-08-13 Thu 23:59> SCHEDULED: <2020-08-09 Sun>
       :LOGBOOK:
       CLOCK: [2020-08-13 Thu 19:23]--[2020-08-13 Thu 23:33] =>  4:10
       CLOCK: [2020-08-13 Thu 11:04]--[2020-08-13 Thu 13:44] =>  2:40
       CLOCK: [2020-08-04 Tue 16:06]--[2020-08-04 Tue 22:06] =>  6:00
       CLOCK: [2020-08-04 Tue 11:24]--[2020-08-04 Tue 13:31] =>  2:07
       CLOCK: [2020-08-03 Mon 12:26]--[2020-08-03 Mon 19:27] =>  7:01
       :END:
       - [-] [6/8] [75%]
         Apply Rainbow Paper + PG methods (I.e PPO, DPG) to choice of Atari and continuous problem.
         In the process, develop the intuition for using these algorithms and
         the framework for automated (I.e plug n play) composition of different RL components

         - [X] Set up env, agents and test/train scripts for logging and automated experiments
         - [X] Double-DQN
         - [X] Dueling Networks
         - [X] IQN
         - [X] FQF
         - [ ] Prioritized replay
         - [X] Multi-step Learning
         - [ ] Noisy Nets


***** TODO Establish Trading RL environment [1/8] [12%]
      SCHEDULED: <2020-08-22 Sat> DEADLINE: <2020-09-28 Mon>
      :LOGBOOK:
      CLOCK: [2020-09-08 Tue 11:10]--[2020-09-08 Tue 13:11] =>  2:01
      CLOCK: [2020-09-02 Wed 17:29]--[2020-09-02 Wed 20:41] =>  3:12
      CLOCK: [2020-08-31 Mon 20:26]--[2020-08-31 Mon 22:55] =>  2:29
      CLOCK: [2020-08-31 Mon 13:03]--[2020-08-31 Mon 17:12] =>  4:09
      CLOCK: [2020-08-30 Sun 16:35]--[2020-08-30 Sun 22:32] =>  5:57
      CLOCK: [2020-08-30 Sun 11:24]--[2020-08-30 Sun 12:04] =>  0:40
      CLOCK: [2020-08-29 Sat 13:52]--[2020-08-29 Sat 21:27] =>  7:35
      CLOCK: [2020-08-27 Thu 17:02]--[2020-08-27 Thu 20:02] =>  3:00
      CLOCK: [2020-08-27 Thu 15:28]--[2020-08-27 Thu 16:30] =>  1:02
      CLOCK: [2020-08-26 Wed 18:34]--[2020-08-26 Wed 23:13] =>  4:39
      CLOCK: [2020-08-26 Wed 13:30]--[2020-08-26 Wed 16:34] =>  3:04
      CLOCK: [2020-08-25 Tue 20:30]--[2020-08-25 Tue 23:30] =>  3:00
      CLOCK: [2020-08-25 Tue 16:21]--[2020-08-25 Tue 19:30] =>  3:09
      :END:

       ALL Trading stategies fit into the RL framework. 
       env state -> model -> action -> env  reward + new state 
       This is model independent, I.e may be decision trees or manual crossovers etc

       Objectives
       Rewrite trading environment from the ground up (+ integrate arena into RL setup.)
       As with arena, generalize to multi-dimensional inputs I.e Multiple assets
       Make visualizing + monitoring tools in Qt (I.e pyQt and pyqtgrah)
       Enable distributed computation and networking (I.e data feeds) early.
       Don't plan in advance too much, just keep these things in mind.
       Build ground up, as you need to not waste time.
       Work end-to-end now, instead of over-compartmentalising the components
       Work on the direct task of executing profitable trading stategies.

       - [X] Setup Synth environments  [5/5]
         - [X] Formalize principled action space
         - [X] Data-Generating Processes
         - [X] mean-reversion I.e sine
         - [X] Make base viz tools - Qt
         - [X] Accounting
       - [ ] Rewrite main logic components of arena in c++ for env use in RL
       - [ ] Establish tests
       - [-] Make and train agents to play the synth [2/4] [50%]
         - [X] Extend Control Panel for training
         - [X] DQN
         - [ ] PG
         - [ ] Make Scalable [0/3] [0%]
           - [ ] multiprocessing
           - [ ] zmq 
           - [ ] ray
       - [ ] Robust pre-processing
       - [ ] Test on more data generating processes and implement some Sota [0/6] [0%]
         - [ ] ad-hoc - I.e trended
         - [ ] ad-hoc - Multi-Asset relationships - statistical arbitrage
         - [ ] Experimental - I.e via representations from from VAE/GAN (I.e as in world model)
         - [ ] Extensions I.e Actor-Critic, PPO
         - [ ] Model-Based I.e VAE/GAN
         - [ ] Analytical processes I.e Ornstein-Uhlenbeck
       - [ ] Robust pre-processing
       - [ ] Train on idealized data 
       - [ ] Train/Test on real data


**** DONE Rollers [5/5] [100%] 
     CLOSED: [2020-07-02 Thu 19:58] DEADLINE: <2020-06-26 Fri> SCHEDULED: <2020-06-15 Mon>
     :LOGBOOK:
     CLOCK: [2020-06-20 Sat 13:58]--[2020-06-20 Sat 14:23] =>  0:25
     :END:
     Currently written in cython and nearly finished though considering rewriting in C++ and using cython 
     to wrap - this allows for better native extensibility for future revisions of the preprocessing algorithms. 
     This will also serve as an educational exercise for C++.
     C++ Classes will be designed for extensibility and imperative composability.

     - [X] Read/Write HDF + Plot using GNUplot or similar
     - [X] Consolidate C++ -> Python + testing workflow
     - [X] Write simple baseline rollers 
     - [X] Recreate the Cython Classes in C++ and test 
     - [X] Wrap the C++ classes in Python with a nice API and docs
**** DONE Add Tests And Implement RollerY [9/11] [81%]
     CLOSED: [2020-07-13 Mon 17:34] DEADLINE: <2020-07-13 Mon 23:59>
     :LOGBOOK:
     CLOCK: [2020-07-13 Mon 19:30]--[2020-07-13 Mon 22:54] =>  3:24
     CLOCK: [2020-07-13 Mon 15:44]--[2020-07-13 Mon 17:32] =>  1:48
     CLOCK: [2020-07-13 Mon 14:22]--[2020-07-13 Mon 14:52] =>  0:30
     CLOCK: [2020-07-13 Mon 11:00]--[2020-07-13 Mon 12:28] =>  1:28
     CLOCK: [2020-07-12 Sun 23:40]--[2020-07-13 Mon 01:29] =>  1:49
     CLOCK: [2020-07-12 Sun 20:37]--[2020-07-12 Sun 22:11] =>  1:34
     CLOCK: [2020-07-12 Sun 19:13]--[2020-07-12 Sun 20:11] =>  0:58
     CLOCK: [2020-07-12 Sun 11:00]--[2020-07-12 Sun 12:00] =>  1:00
     CLOCK: [2020-07-11 Sat 20:53]--[2020-07-11 Sat 22:54] =>  2:01
     CLOCK: [2020-07-10 Fri 22:00]--[2020-07-11 Sat 00:58] =>  2:58
     CLOCK: [2020-07-10 Fri 17:02]--[2020-07-10 Fri 19:29] =>  2:27
     CLOCK: [2020-07-10 Fri 16:07]--[2020-07-10 Fri 16:50] =>  0:43
     CLOCK: [2020-07-10 Fri 11:10]--[2020-07-10 Fri 12:46] =>  1:36
     :END:
     - [X] Add Tests for Continuous Timeframes with Pandas as Reference
       C++ Rollers Are 1000< FASTER than Pandas !! - Mostly due to custom apply(lambda x: f(x)) loops
     - [X] Confirm Positive Tests
     - [X] Add Tests for Discrete Timeframes with Pandas as Reference
     +- [ ] Confirm Positive Tests+
       ---------------------------------------------------------- 
       SKIPPING DISCRETE TIMEFRAMES FOR NOW AS IT IS NOT CRITICAL 
       AND ROLLERY + SAMPLING IS MORE IMPORTANT 
       ---------------------------------------------------------- 
     - [X] Translate + set pandas reference for testing RollerY
     - [X] Reformulate RollerY to separate functions for outCont and outLabel
       For outCont - just shift xFeats instead of recalculating!
     - [X] Validate via Test.
     - [X] Test Sequential Stateful Behaviour for RollerX 
     - [X] Test Sequential Stateful Behaviour for RollerY.shift()
     - [X] Check outLabels are looking alright - numpy version looks good
     - [ ] Test logic for RollerY.roll()
     - [ ] Test Sequential Stateful Behaviour for RollerY.roll()


     For YLabels:
      NUMPY IMPLEMENTATION IS ALREADY VECTORIZED AND FAST
      NO CACHE NEEDED AS yFeats are used.
      SUFFICIENT FOR RESEARCH PURPOSES.

     For now, can focus on things like gramian matrices and matrix profiles, the latter for which
     there are already efficient libraries available - stumpy has incremental impl for streaming.
     
     MAIN IMPERATIVE
     Crucial to get preprocessing down for more research and exploration!

**** TODO Add more time series features
     :LOGBOOK:
     CLOCK: [2020-07-09 Thu 22:10]--[2020-07-09 Thu 22:53] =>  0:43
     CLOCK: [2020-07-09 Thu 20:37]--[2020-07-09 Thu 20:37] =>  0:00
     CLOCK: [2020-07-09 Thu 18:22]--[2020-07-09 Thu 20:37] =>  2:15
     :END:
     ONGOING DEVELOPMENT

     These have varying importance's and so the task will be closed 
     when the pressing ones have been completed. The number and % bars
     will still show the number of tasks uncompleted, for future reopening.
     Use Template Meta-Programming to optimize various combinations of function choices
    
